system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

mergeTolerance 1e-6;

castellatedMesh true;
snap            true;
addLayers       false; 

geometry
{
    studyCylinder
    {
        type searchableCylinder;
        point1 (0 0 -5); 
        point2 (0 0 5); 
        radius 0.5; 
    }
}

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    features
    (
    );

    refinementSurfaces
    {
        studyCylinder
        {
            level (2 2); 
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
    }

    locationInMesh (2 2 0); 
    
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}

addLayersControls
{
}

meshQualityControls
{
    #include "meshQualityDict"

    errorReduction 0.75;

    nSmoothScale 4;
}